{
    "In this fiscal year to date": "Requires a date range based on the fiscal year, which typically starts on a specific month (e.g., April or October), and must be calculated using offset logic from calendar year boundaries (e.g., start of year plus months), not 'start of year' alone.",
    "Stationery & Printing": "Should be matched as a substring within the 'account' or category field using function like instr() or LIKE, rather than exact match on 'Product_Service' column, to correctly identify relevant expense/invoice accounts.",
    "Sold Marine Supplies": "Refers to revenue-generating transactions for Marine Supplies, which must be identified by joining with the chart_of_accounts table and filtering for account_type in ('Income', 'Other Income'), not solely relying on Transaction_TYPE = 'Sale'.",
    "Today": "Requires filtering Transaction_DATE to cover the full calendar day from midnight to midnight using date(Current_Date), not relying solely on date('now') without explicit range boundaries, to ensure completeness of daily data.",
    "GROUP BY clause in aggregation": "When computing averages over multiple transactions, no GROUP BY on individual transaction IDs should be used, as it prevents proper aggregation across all relevant records; AVG() should operate on the entire filtered set without per-transaction grouping.",
    "Sold Furniture": "Refers to revenue-generating transactions only, requiring a filter on account_type in ('Income', 'Other Income') to ensure only sales (credit entries) are considered, not all transactions involving the product.",
    "Dues & Subscriptions": "Is captured via substring match in the account field (e.g., using instr(account, 'Dues & Subscriptions')), not through exact match on Product_Service, which may represent a different level of categorization.",
    "Invoices outstanding": "Refers to transactions where transaction_type = 'invoice' and there is an unpaid balance (e.g., open_balance > 0 or equivalent status like AR_paid = 'No'), not just any transaction linked to a customer.",
    "In Last month": "Refers to the full prior calendar month, defined as starting on the first day of the previous month and ending on the last day of that month, using date functions like 'start of month' and '-1 months', not a rolling -30-day window from current date.",
    "Spend on [Person]": "Indicates the person is the vendor or payee receiving payment; therefore, transactions should be filtered by vendor name in the transaction table, not by joining to a customers table or treating the person as a customer.",
    "Sold Tablets": "Refers to revenue-generating transactions, requiring a filter on account_type in ('Income', 'Other Income') to ensure only sales are considered, not all transactions involving the product.",
    "Sold Financial": "Refers to revenue-generating transactions for the 'Financial' product, requiring a filter on account_type = 'Income' or 'Other Income' to ensure only sales (not returns, adjustments, or internal transfers) are considered.",
    "Spend on Annette Flores": "Indicates that Annette Flores is the vendor (payee), so transactions should be filtered by vendor name, not customer name. The SQL must reference the vendor field or a vendors table, not customers.",
    "in dec last year": "Requires dynamically calculating December of the previous calendar year using relative date functions (e.g., current_date minus one year, then start of December), not hardcoding fixed date ranges like '2022-12-01' to '2022-12-31', which are not portable across years.",
    "In This week": "Refers to the current calendar week (e.g., starting from Sunday or Monday depending on system settings), defined using bounded date logic such as date(current_date, 'weekday 0', '-6 days') to date(current_date, 'weekday 6'), not a rolling 7-day period.",
    "In Last year": "Refers to the previous calendar year (e.g., from 'start of year' of current year minus one year, to 'start of year' of current year), requiring precise date arithmetic rather than ambiguous expressions like DATE('last year').",
    "Sold Coal": "Refers to revenue-generating transactions involving Coal, requiring a filter on account_type in ('Income', 'Other Income') or equivalent revenue categories to ensure only sales are considered, not all transactions with Product_Service = 'Coal'.",
    "Sold Games": "Refers to revenue-generating transactions (credit entries) in accounts of type 'Income' or 'Other Income' where the associated product or service category is 'Games', requiring a reliable mapping from transaction records to product categories, not just a direct match on Product_Service as a key.",
    "Sales": "Refers to credit transactions in revenue accounts such as 'Income' or 'Other Income'; must filter by these account types rather than summing all transaction amounts which may include non-sales entries.",
    "Lowest bill": "Refers to the minimum 'credit' value among transactions where transaction_type = 'bill', not just any transaction type. Must explicitly filter for bills to exclude payments, credits, or other non-bill entries.",
    "Sold Non-musical": "Refers to revenue transactions for 'Non-musical' products/services, which must be validated by joining with the chart of accounts to ensure the associated account has type 'Income' or 'Other Income', not just filtering by product/service name in the transaction table.",
    "In aug this year": "Refers to the month of August in the current year, which must be derived dynamically using date functions (e.g., based on current_date), not hardcoded to a specific year like '2023-08-01'.",
    "Sold Mailbox Services": "Refers to revenue-generating transactions involving the service, which must be validated by joining with chart_of_accounts to confirm the associated account is of type 'Income' or 'Other Income', not just filtering by product_service alone.",
    "Spend on Refunds-Allowances": "Refers to summing 'debit' amounts from accounts classified under 'Expense' or 'Other Expense' in the chart_of_accounts where the account name contains 'Refunds-Allowances', not filtering by Transaction_TYPE.",
    "As of This year": "Refers to transactions within the current calendar year, starting from January 1st of the current year to present, which should be captured using transaction_date BETWEEN date('now', 'start of year') AND date('now') or equivalent, not just strftime('%Y', ...).",
    "Invoices created for": "Implies filtering transactions where transaction_type = 'invoice' and the associated service description matches the specified service, not inferring from product-like fields such as Product_Service without confirming invoice context.",
    "As of this month": "Refers to transactions within the current calendar month up to today, bounded by date('now', 'start of month') and date('now'), not extending into future dates (e.g., '+1 month').",
    "Spend on Discounts given": "Refers to summing 'debit' entries in accounts related to 'Discounts given' (typically expense or contra-revenue accounts) for transactions associated with a specific customer, not filtering by employee or product/service fields.",
    "Discounts given": "Is an account-level description that should be matched using account names or descriptions in the chart of accounts, not via Product_Service field which may not capture account-specific labels.",
    "Spend on Training": "Refers to summing 'debit' entries in expense accounts related to the training description, not joining to a 'products' table or treating the training as a purchased product/service.",
    "Debit entries for expenses": "Outflows in expense accounts are represented by 'debit' values; using generic 'Amount' without distinguishing debit/credit can lead to incorrect aggregation, especially if Amount is net or signed inconsistently.",
    "Payment from customer": "Should be identified by filtering on transaction_type = 'payment' and matching the customer name (e.g., via join with customers table), not by selecting from a vague status column such as AR_paid which may not represent actual received payments.",
    "Spend on Product Service": "Refers to summing 'debit' entries in accounts classified as 'Expense' or 'Other Expense' related to the service, not summing 'Amount' from transactions linked via product/service columns without account type filtering.",
    "Fees Billed": "Is an account category (e.g., identified via account name or description in the chart of accounts), not a transaction type; must be linked through account classification, not filtered as transaction_type = 'Fees Billed'.",
    "Lowest invoice value": "Requires filtering for transaction_type = 'invoice' before applying MIN on the credit amount, as invoice value refers specifically to credited amounts from invoices, not general transaction amounts.",
    "Invoices for Permits": "Must filter transactions where transaction_type = 'invoice' AND the service/product description (e.g., account, memo, or service field) contains 'Permits', not just Product_Service = 'Permits' which does not restrict to invoice transactions.",
    "Unpaid invoices as of August": "Refers to invoices with open_balance > 0 as of the end of August, not just those created in August. Must evaluate outstanding balance status at that point in time, not only transaction date.",
    "As of Last fiscal year": "Refers to transactions occurring within the specific date range of the previous fiscal year (e.g., from April 1st to March 31st of the following year for a April-March fiscal calendar), not simply any transaction before one year ago from today. Requires bounded date filtering using fiscal logic such as 'start of year', offset by months.",
    "In this year to date": "Refers to the period starting January 1st of the current calendar year up to the current date, implemented using date(current_date, 'start of year'), not a rolling 365-day window from today.",
    "Debit vs Credit for Spending": "To capture 'spending', SQL must filter on 'debit' values in expense accounts, not sum general 'Amount' fields without directionality, as Amount alone does not distinguish between inflows and outflows.",
    "Account related to A/R": "Must be identified by matching the transaction's account to 'Accounts Receivable (A/R)' via account name or type in the chart_of_accounts, rather than relying on boolean flags like 'AR_paid', which do not indicate the nature or purpose of the transaction.",
    "Accounts Receivable (A/R)": "Should be identified through account names or descriptions in the chart_of_accounts table (e.g., via string matching on account_name), not by transaction_type, which does not represent spending categories.",
    "Account join logic": "The 'Account' field in master_txn_table should be joined to 'account_name' in chart_of_accounts, not to 'id'; joining on ID fields when the actual link is via name can lead to incorrect account mappings.",
    "Invoices for service": "Requires filtering by transaction_type = 'invoice' AND a condition matching the service description (e.g., via account or description field), not just Product_Service equality, to ensure only actual invoices for the specified service are included.",
    "As of this quarter": "Refers to the current calendar quarter (e.g., Q1: Jan–Mar, Q2: Apr–Jun, etc.), requiring date filtering based on quarter start date using dynamic calculation from the current date, not a rolling 3-month window which may misalign with quarter boundaries.",
    "Amount of spend": "Must be calculated using 'debit' values only, as 'spend' implies outflows; summing 'Amount' without distinguishing debit/credit direction risks including inflows (credits) and misrepresenting expenditure.",
    "Q1 this year": "Spans January to March of the current calendar year and should be derived using robust date functions such as 'start of year' and offset by months, rather than fragile string-based month comparisons ('01' to '03') on formatted dates.",
    "Q2 this year": "Corresponds to the date range from April 1 to June 30 of the current year; requires filtering using dynamic date logic that aligns with calendar quarters, not just month strings.",
    "Invoices for Computer Repairs": "Implies filtering on transactions where 'Computer Repairs' is associated with the account or description field using partial matching (e.g., via instr or LIKE), not an exact match on a Product_Service column.",
    "Q3 last year": "Corresponds to transactions occurring between July 1 and September 30 of the previous calendar year, which should be derived using relative date functions rather than hardcoded values or assumptions about table joins.",
    "Spend on Blueprinting services": "Refers to summing 'debit' entries in accounts classified as expenses (e.g., account_type in ('Expense', 'Other Expense')) where the account description contains 'Blueprinting services' as a partial match, not an exact match on a product/service name like 'Blueprinting'.",
    "Spend on [Account Name]": "Refers to summing 'debit' entries in the general ledger where the transaction is posted to a specific account (e.g., 'Arizona Dept. of Revenue Payable'), requiring a join with the chart_of_accounts table and filtering by account name or description, not by vendor.",
    "Unpaid": "Indicates that only transactions with an open balance (e.g., open_balance > 0) or explicitly unpaid AR status should be included; relying solely on AR_paid = 'No' without type context may capture non-invoice transactions.",
    "Invoices for a customer": "Requires explicitly filtering transaction_type = 'invoice' in addition to customer association; failing to do so may include non-invoice transactions such as payments or adjustments.",
    "In This quarter": "Refers to the current calendar quarter (e.g., Jan–Mar, Apr–Jun), which must be calculated using date functions to determine the quarter start date, not approximated as a rolling 3-month window from today.",
    "Uncategorized Income": "Refers to an account or category in the chart of accounts (e.g., account_name containing 'Uncategorized Income'), not a product or service; filtering should be done on account-related fields, not T1.Product_Service.",
    "Chart of Accounts linkage": "To accurately classify or analyze transactions by account, always join the transaction table with the chart_of_accounts table using account name or code; validate classifications by enforcing filters on both account_name (e.g., containing 'Accounts Receivable (A/R)') and account_type (e.g., 'Expense', 'Other Expense'), rather than relying on transaction type alone.",
    "This week to date": "Refers to the period from the first day of the current calendar week—determined by weekday-based truncation to Sunday or Monday, using deterministic date functions like date('now', 'weekday 0') for Sunday or date('now', 'weekday 0', '-6 days') for Monday—up to and including the current date, and must be computed using calendar-aware logic rather than a rolling 7-day window or strftime arithmetic.",
    "Max invoice value": "To compute the maximum invoice value, filter transactions to include only those with transaction_type = 'invoice' before applying the MAX(credit) aggregation, ensuring that non-invoice entries such as payments, credits, or adjustments are excluded from consideration.",
    "Unpaid invoices": "Unpaid invoices are transactions where transaction_type = 'invoice' and open_balance > 0, ensuring the result reflects only invoice-type records with a quantifiably outstanding balance rather than relying on potentially outdated or non-specific payment status flags.",
    "Invoices remained unpaid": "Identify transactions where transaction_type = 'invoice' and open_balance > 0 to capture outstanding financial obligations, ensuring accuracy by relying on actual balance conditions rather than potentially outdated or incomplete status flags like AR_paid or AP_paid.",
    "As of Last quarter": "Refers to data or transactions occurring within the most recently completed calendar quarter (e.g., Q1, Q2, Q3, or Q4), determined by dynamic date logic that identifies fixed quarterly boundaries relative to the current date; excludes rolling 90-day periods and requires floor-based quarter alignment using month-level truncation.",
    "Highest invoice value": "To determine the highest invoice value, apply the MAX() aggregate function on the credit amount only after filtering transactions to include those where transaction_type = 'invoice', ensuring exclusion of non-invoice types such as payments, adjustments, or entries based solely on service categories like 'Repair & Maintenance'. This guarantees accurate representation of the largest single invoice value within the defined transaction scope.",
    "Spend on Loan Payable": "Sum only the debit entries from expense-type accounts related to 'Loan Payable' or its sub-accounts for a specific customer, as these represent actual outflows; exclude credit entries and amounts from the liability account itself, which do not reflect spending.",
    "Loan Payable": "Identify 'Loan Payable' as a liability account by matching the term as a substring within the account name using pattern-matching methods like LIKE or instr, and ensure correct interpretation of transactions as payments through debits to the liability or corresponding credits to cash, relying on account type semantics rather than exact name matches.",
    "In Dec last year": "Filter for the full month of December in the prior calendar year using dynamic date logic relative to current_date, ensuring complete temporal bounds from December 1 to December 31 with precise start and end date arithmetic to handle edge cases, time components, and nulls in transaction_date.",
    "Spent": "Refers to the sum of 'debit' amounts from transaction records associated with accounts of type 'Expense' or 'Other Expense', excluding credits and general 'Amount' fields that may obscure directionality by including inflows or outflows indiscriminately.",
    "During last year": "Filter for transactions occurring in the full prior calendar year by dynamically computing the previous year as strftime('%Y', current_date) - 1 and ensuring complete January–December alignment; avoid hardcoded years and partial periods by combining year extraction with explicit month bounds or full-date range filtering.",
    "Invoices created": "Filter transactions to include only those with transaction_type = 'invoice', excluding all other types such as payments, credits, or quotes, to ensure accurate representation of created invoices.",
    "Amount spent": "Calculate 'Amount spent' by summing only the 'debit' values from transaction records, explicitly excluding credit entries and non-expense accounts; ensure accuracy by restricting to transactions in accounts where 'account_type' is 'Expense' or 'Other Expense' to reflect genuine outflows.",
    "Total invoice value": "Compute the sum of credit amounts only from transactions where transaction_type = 'invoice', ensuring no other transaction types are included in the aggregation.",
    "This quarter": "Refers to the current calendar quarter (e.g., Jan–Mar, Apr–Jun) determined by dynamically calculating the quarter's fixed start and end dates from the current date using date functions; must not use hardcoded values, placeholders, or rolling 3-month windows.",
    "Receive payment from": "Filter for transactions where transaction_type = 'payment' to capture verified incoming cash receipts from external parties, ensuring the counterparty (e.g., customer) is explicitly on the receiving side and excluding non-payment types like invoices or refunds. Confirm the transaction represents a credit entry linked to the specified entity, with no reliance on status flags alone or ambiguous vendor/customer matching.",
    "Last 30 days": "Refers to a date range from 30 days prior to the current date, inclusive of today, and must be implemented using BETWEEN date('now', '-30 days') AND date('now') to ensure correct temporal bounds while excluding future-dated transactions; this filter should be combined with appropriate transaction or account type filtering and aggregation as required by the query context.",
    "Spend on Fees Billed": "Sum the 'debit' amounts from accounts classified as 'Expense' or 'Other Expense' in the chart of accounts where the account name or description includes 'Fees Billed', ensuring only actual expense transactions are included without reliance on Transaction_TYPE filtering.",
    "As of This month": "Refers to transactions occurring from the first day of the current calendar month up to and including the current date; the filter must use a closed range bounded by date('now', 'start of month') and date('now'), excluding future dates and ensuring completeness through today.",
    "In q3 last year": "Refers to the calendar third quarter (July, August, September) of the year prior to the current calendar year, dynamically computed using relative date logic to ensure alignment with actual calendar boundaries and exclude fiscal quarter assumptions unless explicitly defined.",
    "Spending": "Spending refers to outflow transactions recorded as debit entries in accounts of type 'Expense', 'Other Expense', or 'Payable'; SQL queries must filter by both account type and transaction direction (debit) to ensure accurate representation, avoiding indiscriminate use of raw 'Amount' fields that may include inflows or credits.",
    "By customer": "Group by a reliable customer identifier, preferably a unique customer ID rather than name, to ensure accuracy and avoid issues with non-unique or inconsistently formatted names; do not introduce additional grouping dimensions (e.g., businessID) or joins unless explicitly supported by the schema or required by the query.",
    "Biggest expense MTD": "Identify the expense-type account (account_type in ('Expense', 'Other Expense')) with the highest cumulative sum of debit amounts in the current month-to-date period, emphasizing aggregated monthly activity rather than individual transaction size.",
    "MTD": "MTD refers to Month-to-Date, which spans from the first day of the current calendar month (using date('now', 'start of month')) to the current date inclusive; always enforce both bounds explicitly with a BETWEEN or equivalent clause to exclude future dates and prevent misinterpretation as a rolling time window.",
    "In this fiscal year": "Refers to the organization's financial year defined by fixed start and end dates (e.g., April 1–March 31), not the calendar year or a rolling 365-day period; must be computed using precise date arithmetic such as date(current_date, '-3 months', 'start of year', '+3 months') to align with fiscal boundaries.",
    "In this week": "Refers to the current calendar week bounded by standard week start (e.g., Sunday or Monday), defined precisely using week-aligned date functions such as 'weekday 0' to capture exact week boundaries, not a rolling 7-day window from the current date.",
    "During Last year": "Apply dynamic date filtering to include the entire prior calendar year relative to the current date, using timezone-aware relative arithmetic (e.g., 'now', '-1 year') and explicit year extraction (e.g., strftime('%Y', ...) ) without hardcoding any year values.",
    "Remained unpaid": "An invoice that has an outstanding balance as of the current date, identified by open_balance > 0, which ensures accuracy over status flags like AR_paid that may not reflect the true financial state due to potential data lag or manual overrides.",
    "As of Last month": "Refers to data or transactions occurring in the full previous calendar month, from the first day of last month to the last day of last month, specifically bounded by date('now', 'start of month', '-1 months') and date('now', 'start of month', '-1 days'); it excludes any rolling time window interpretation such as the past 30 days.",
    "Sales receipts": "Filter transactions to include only those where transaction_type = 'sales receipt' to exclude non-sales transactions such as returns, voids, invoices, or payments, ensuring that all aggregations and calculations are based solely on confirmed sales with associated quantities.",
    "Spend on vendor": "Sum the 'debit' amounts from transactions where the vendor field explicitly matches the specified party, filtering only for expense-related outflows without implicit joins or temporal assumptions unless stated; ensure correct grouping by time periods such as year when aggregation spans multiple periods to prevent cross-period summation errors.",
    "Monthly spend": "Aggregate total outflows (debits) by calendar month using date truncation to the start of each month (e.g., date(transaction_date, 'start of month') or equivalent) to produce a time-series of monthly totals, ensuring grouping by year and month and selecting both the truncated period and sum to enable trend analysis over time. Do not filter to the current month or return a single aggregated sum unless explicitly requested.",
    "In dec last year": "Filters for transactions or records in December of the prior calendar year relative to the current date, using dynamic date functions (e.g., 'current_date - 1 year' offset to December) rather than hardcoded dates to ensure correct results across different query execution dates.",
    "First invoice value": "The Amount of the earliest transaction by transaction_date where transaction_type = 'invoice', after filtering for invoice-type transactions to exclude non-invoice records, and ordering strictly by transaction_date in ascending order to ensure correct temporal selection; this applies to the full historical dataset unless a specific time window is explicitly provided.",
    "Biggest expense YTD": "Identify the account with the highest cumulative sum of 'debit' amounts where account_type is 'Expense' or 'Other Expense' and transaction_date falls within the current year-to-date period, defined as starting from the beginning of the calendar year up to and including the current date, using precise date arithmetic such as transaction_date BETWEEN date(current_date, 'start of year') AND current_date.",
    "Sold": "A 'Sold' transaction refers to a revenue-generating sale event that must be recorded in an account with account_type in ('Income', 'Other Income') as verified by joining the transaction table with the chart_of_accounts; it must not be inferred solely from product references, transaction descriptions, or transaction_type labels such as 'Sale', which may include non-revenue entries.",
    "YTD": "YTD refers to the period from the start of the current calendar year (January 1) to the current date, inclusive, and must be implemented using a date filter such as transaction_date BETWEEN DATE('now', 'start of year') AND DATE('now'); it explicitly excludes rolling 365-day windows and historical data outside the current year.",
    "Sales receipts record": "Must filter transactions to include only those where transaction_type = 'sales receipt', explicitly excluding all other types such as returns, voids, invoices, or non-sales-related entries to ensure calculations reflect confirmed and valid sales only.",
    "Spend on Vendor": "Sum 'debit' amounts from transactions where the vendor field matches the specified payee name (case-insensitively if necessary), ensuring outflows are filtered by expense or transaction tables with explicit vendor/payee alignment and avoiding joins to customer tables or indiscriminate use of 'Amount' fields that lack directionality. Exclude credit entries and do not restrict to current periods unless explicitly requested, while supporting temporal grouping when required.",
    "This year": "Filter transactions dynamically for the current calendar year using date(Transaction_DATE) BETWEEN date('now', 'start of year') AND date('now'), ensuring correct inclusion of all records from January 1 to the present day without hardcoded values or string-based comparisons.",
    "Sold Catering": "Refers to revenue-generating transactions for the Catering service, specifically those recorded in accounts of type 'Income' or 'Other Income', ensuring the transaction reflects an actual sale rather than a catalog listing or non-revenue activity.",
    "Last invoice value": "The Amount of the most recent transaction where transaction_type = 'invoice', determined by ordering on the finest-grained timestamp (e.g., transaction_time or equivalent) in descending order and selecting the top record after applying all filters; ensures only invoice-type transactions are considered and prioritizes temporal recency over amount magnitude or coarse date grouping.",
    "Invoice": "Must explicitly filter for transaction_type = 'invoice' to include only invoice transactions, as other transaction types (e.g., payments, credits) may reference the same service, product, or date but are not invoices.",
    "Average bill": "Compute the average of 'Amount' values where transaction_type = 'bill', ensuring that only bill transactions (representing invoices issued by vendor to customer) are included by explicitly filtering before aggregation; if multiple line items exist per transaction, first sum amounts at the transaction level (e.g., by Transaction_ID) to prevent bias from line item fragmentation.",
    "Bill": "A bill is a specific transaction type representing an invoice or charge issued by a vendor, and must be explicitly filtered using transaction_type = 'bill' to ensure accuracy; relying on vendor-customer relationships or omitting this condition may include irrelevant transactions such as payments, credits, or other non-bill activity.",
    "MTD (Month-to-Date)": "MTD requires filtering transactions from the start of the current calendar month to the current date inclusively, using a precise date range such as BETWEEN date('now', 'start of month') AND date('now') to ensure accurate aggregation of only current-month data up to today, excluding future or past-period records.",
    "Last fiscal year": "Refers to the most recently completed 12-month fiscal period, which must be dynamically calculated using date arithmetic relative to a configurable fiscal year start (e.g., April, July, or October), not hardcoded dates or calendar-year equivalents; requires precise filtering based on fiscal boundaries (such as April 1 to March 31) through functions that adjust the current date by month and year offsets, ensuring alignment with organizational fiscal calendars rather than rolling 365-day or strftime-based logic.",
    "This month to date": "Refers to the period from the first day of the current calendar month up to and including the current date, inclusive; must be implemented using transaction_date BETWEEN DATE('now', 'start of month') AND DATE('now') to ensure correct calendar alignment and exclude rolling 30-day interpretations.",
    "Yesterday": "Refers strictly to the single calendar day immediately preceding the current date, and must be expressed in SQL using date arithmetic such as DATE('now', '-1 day') to ensure proper evaluation; comparing a date column to the string literal 'yesterday' is invalid and must be avoided.",
    "Quantity sold": "Sum the 'quantity' field from transaction records where transaction_type is 'invoice' or 'sales receipt' to include only positive sales, excluding returns or adjustments, and filter by relevant product, customer, and sale context without unnecessary grouping when a single product is specified.",
    "Invoice value": "Select the credit or invoice-specific amount field from transactions where transaction_type = 'invoice' to ensure only invoice-related credit entries are included, excluding general 'Amount' fields that may reflect debits, payments, or non-invoice transactions.",
    "Last year": "Refers to the full prior calendar year, from January 1 to December 31 of the year immediately preceding the current date, and must be computed using dynamic, calendar-aware date functions (e.g., strftime('%Y', current_date) - 1) to ensure accurate year-over-year comparisons without hardcoded values or rolling time windows; this definition applies universally across all date filters unless explicitly modified by transaction context.",
    "This quarter to date": "Refers to the period starting from the first day of the current calendar quarter—computed dynamically based on the current date using quarter-aligned boundaries (January 1, April 1, July 1, or October 1)—and ending on the current date; must not be approximated as a rolling 3-month or 90-day window and requires exact date arithmetic to enforce both the quarter-aligned start and the 'to date' end.",
    "Monthly spend on Vendor": "Calculate the sum of 'debit' amounts from transactions for each calendar month, grouped by the start of the month and filtered to include only those where the vendor name matches the specified party, ensuring the entity is treated as a vendor and not a customer, with results spanning all available months to show temporal trends without aggregation into a single total.",
    "In q1 this year": "Dynamically compute the date range for the first quarter of the current year using temporal functions such as 'start of year' and 'start of year + 3 months - 1 day', ensuring correctness across years without any hardcoded dates like '2024-01-01' to '2024-03-31'. This approach guarantees accurate, reusable logic in time-based filters regardless of the execution year.",
    "Spend on [Vendor]": "Refers to debit transactions where the vendor or payee field in the transaction table explicitly matches the specified vendor name, requiring a direct filter on the vendor field without joining to customer or employee tables unless explicitly stated. Exclude any inflows, customer-side transactions, or payments inferred from user roles or CreatedUSER fields.",
    "In jan this year": "Filter for the entire calendar month of January in the current year using dynamic date functions that derive the year from the system date, ensuring precise alignment with true calendar boundaries through bounded date arithmetic rather than string matching or hardcoded values.",
    "Spend on [Account]": "Spend on [Account] denotes the aggregated sum of debit amounts from transactions posted to a specific account in the chart of accounts, limited to accounts classified as 'Expense', 'Other Expense', or liability-type payable accounts; it requires explicit SUM aggregation and excludes vendor-level details, payment transactions, or filters on general transaction amounts outside the accounting entry structure.",
    "In July during last year": "Filter transactions to include only those occurring in July (month '07') of the prior calendar year, using dynamic date functions to compute the correct year relative to the current date (e.g., strftime('%Y', date('now', '-1 year'))), ensuring no hardcoded values or fiscal assumptions are used.",
    "This fiscal year to date": "Refers to the period from the start of the current fiscal year—determined by applying offset logic (e.g., date(current_date, '-3 months', 'start of year', '+3 months') for a fiscal year beginning in April)—to the current date; must use dynamic fiscal calendar calculations rather than calendar-year functions or hardcoded dates.",
    "Count of outstanding invoices": "Compute a single aggregate count of distinct invoice records (e.g., COUNT(DISTINCT transaction_id)) that meet the outstanding criteria, ensuring no grouping is applied to avoid multiple result rows.",
    "Outstanding invoices": "Refers to transactions where transaction_type = 'invoice' and open_balance > 0, explicitly excluding non-invoice transactions and ensuring unpaid status is determined by a positive remaining balance rather than payment flags alone.",
    "Payment method [payment_method]": "Filter transactions by substituting [payment_method] with the actual payment method value (e.g., 'Cash', 'Credit Card') in a parameterized condition; using the literal string 'payment_method' results in incorrect or empty results and must be avoided. Ensure filtering occurs directly on the transaction-level payment method field within sales records, not through indirect joins unless aggregation preserves transactional integrity.",
    "Average invoice value": "Calculate the average of the credit amount exclusively for transactions where transaction_type = 'invoice', ensuring that payments, credits, or other non-invoice transaction types are excluded to prevent distortion of the metric.",
    "In Jan this year": "Filter records to include only those with transaction_date in the full month of January of the current calendar year, using dynamically computed date boundaries from the first day of the year to the last day of January derived from the current date, ensuring correctness across years without hardcoding and respecting complete calendar month boundaries.",
    "Count of invoices": "Use COUNT(DISTINCT transaction_id) to count each invoice exactly once, ensuring accuracy by preventing overcounting due to joins, multiple line items, or split entries; avoid COUNT(*) or non-distinct IDs which may inflate results.",
    "Receive payment": "A transaction where transaction_type = 'payment' must be explicitly filtered to represent actual cash inflows from customers, ensuring exclusion of non-payment types such as invoices, credits, or refunds; the query must rely solely on precise type-based filtering and not ambiguous indicators like status flags or amount columns.",
    "Invoices": "Select only records where transaction_type = 'invoice', explicitly excluding credit memos, adjustments, payments, and all other non-invoice transaction types, irrespective of status, balance, or associated metadata.",
    "Number of invoices": "Count distinct transaction_id values where transaction_type = 'invoice' to ensure each invoice is counted exactly once, excluding non-invoice transactions such as payments or returns and avoiding overcounting from multiple line items per invoice.",
    "Last time ... sold": "Identify the most recent transaction_date for a product/service by joining with chart_of_accounts to ensure the associated account_type is in ('Income', 'Other Income'), thereby confirming it represents a valid sale; return the single latest such transaction using ORDER BY transaction_date DESC with LIMIT 1 to avoid incorrect results from applying MAX() on an unfiltered dataset.",
    "Spend on Job Materials": "Sum the debit amounts from expense-type accounts (where account_type is 'Expense' or 'Other Expense') that have 'Job Materials' in the account name or description, without joining to product, employee, or customer tables or filtering by 'Product_Service' fields which may capture non-expense transaction details.",
    "Sold Strollers": "Refers exclusively to revenue-generating transactions for strollers, requiring a filter on account_type in ('Income', 'Other Income') via a join with the chart of accounts to confirm the transaction represents a sale, not returns, adjustments, or internal transfers.",
    "Expense account": "An expense account must be confirmed by joining with the chart_of_accounts table to ensure the account type is 'Expense' or 'Other Expense', as transaction labels or debit activity alone are insufficient to classify an account as an expense.",
    "Last quarter": "Refers to the most recently completed calendar or fiscal quarter—defined by fixed quarterly boundaries such as Q1: January–March—determined dynamically relative to the current date; must be filtered using quarter-aware date logic that computes the exact start and end dates of the prior quarter, not as a rolling 90-day or 3-month window from today.",
    "Sold to": "Refers to outbound sales transactions such as invoices or sales receipts issued to the specified customer, filtered by customer identifier and transaction_type in ('invoice', 'sales receipt') while excluding returns, voids, and other non-sale transaction types.",
    "Monthly spend on [Vendor]": "Aggregate total 'debit' amounts by calendar month for transactions associated with the specified vendor, using date truncation to the start of each month for grouping; do not restrict to the current month or involve customer-related tables.",
    "In Q3 last year": "Filter records to the third quarter (July 1 to September 30) of the prior calendar year using relative date arithmetic from the current date—such as truncating to the start of last year and adding six months—without hardcoding any absolute dates; ensure correct temporal alignment by deriving the period dynamically and reference customer data directly from the transaction table if available to avoid erroneous joins.",
    "Biggest expense": "Identify the account with the highest cumulative sum of debit (or negative) amounts over a period, restricted to accounts classified as 'Expense' or 'Other Expense' in the chart_of_accounts, by aggregating outflows per account and excluding non-expense types; this is not determined by a single transaction amount or by summing across all account types indiscriminately.",
    "This fiscal year": "Refers to the current fiscal year-to-date period, dynamically calculated from the organization's fiscal year start date (e.g., April 1 or July 1) using relative date functions anchored to current_date, ensuring alignment with the correct fiscal calendar without hardcoded ranges or rolling 12-month assumptions.",
    "In This year": "Refers to transactions occurring from January 1st of the current calendar year up to and including the current date, accurately captured using transaction_date BETWEEN date('now', 'start of year') AND date('now') to ensure precise boundary inclusion and avoid reliance on strftime or implicit date handling.",
    "Expense accounts": "Identify expense accounts by joining transactions with the chart_of_accounts table and filtering for account_type IN ('Expense', 'Other Expense') to ensure only genuine outflows are included; this filter is required because debit activity alone does not signify an expense, as it can also increase assets or reduce liabilities.",
    "In May last year": "Filter records to include only those occurring within the full calendar month of May (from May 1 to May 31) of the previous calendar year, using dynamic date arithmetic—such as adjusting the current date by one year and setting the month to May with precise start and end boundaries—to avoid hardcoded values and ensure correct temporal alignment for timestamps with time components.",
    "This month": "Filter records from the start of the current calendar month to the current date inclusive, using date('now', 'start of month') for the lower bound and date('now') for the upper bound to ensure accurate time-range confinement within the present month.",
    "Spend": "Spend represents the sum of debit amounts or negative values in the 'Amount' field from transactions in accounts explicitly classified as 'Expense' or 'Other Expense', excluding all revenue-related, asset, liability, or equity accounts and ensuring only outflows are aggregated according to schema-specific conventions.",
    "Last 12 months": "Refers to the 12 completed calendar months, defined from the first day of the month 12 months prior to the current date to the last day of the previous month, using date truncation for alignment with standard financial reporting periods; must be combined with appropriate filters for transaction type, account category, and invoice status to ensure accurate aggregation in business context.",
    "Mean invoice value": "Calculate the average of the 'credit' field across transactions where transaction_type = 'invoice', explicitly excluding non-invoice transactions to prevent distortion; using any other field or omitting the filter invalidates the result.",
    "Invoices created for Service": "Identify transactions where transaction_type = 'invoice' and the associated service context is confirmed through pattern matching (e.g., using instr) in account, description, or similar text fields, rather than relying solely on exact matches in a Product_Service column to ensure comprehensive and accurate service linkage.",
    "Last 7 days": "Refers to the inclusive date range from midnight 7 days ago to the latest timestamp of the current day; implement using Transaction_DATE >= DATE('now', '-6 days') AND Transaction_DATE <= DATE('now', '23:59:59') to ensure precise calendar-day alignment, bounded filtering, and exclusion of future dates.",
    "Last month": "Refers exclusively to the full prior calendar month, defined as the period starting at the first day of the previous month and ending at the last day of that same month, computed using deterministic date arithmetic such as 'start of month' minus one month for the start and 'start of month' minus one day for the end; explicitly excludes any rolling 30-day or relative time window ending on the current date.",
    "Bill received from": "Indicates a transaction where the customer is the recipient and the vendor is the sender, with transaction_type = 'bill' and proper alignment of vendor-customer roles in joins; specifically represents an outgoing charge to the customer (credit to the vendor), requiring both correct role assignment and classification as a bill.",
    "This year to date": "Refers to valid sales transactions from the start of the current calendar year (January 1) to the current date, inclusive, using date('now', 'start of year') as the lower bound and current_date as the upper bound; explicitly excludes rolling periods and requires filtering for confirmed, non-adjusting transactions only."
}